#include<stdio.h>
#include <stdbool.h>
int main(){
    int add=0,cancel=0,dismiss=0,buy=0;
    int coke=0,sun=0,green=0,nut=0,late=0,ame=0,som=0;
    int c=50,s=50,g=50,n=50,l=50,a=50,so=50;
    int select=0,selectsnack=0,selectwalter=0;
    char exit;
    bool Condition1 = true ,Condition2 = true , Condition3 =true,Condition4=true,Condition5=true,Condition6=true;
    printf("welcome\n");
    while(Condition1) {
     printf("\nต้องการเลือกประเภทน้ำหรือขนม\nขนม = 1\nน้ำ = 2 \n");
     scanf("%d", &select);
     if(select == 1){
        printf("------------------------------------------------------------\n");
        printf("เมล็ดทานตะวัน 13 บาท\nถั่วแปบ 20 บาท\nจิ้นส้มหมก 15 บาท");
        printf("\n------------------------------------------------------------\n");
        printf("กรุณาเลือกสินค้า\n");
        printf("เลือกเมล็ดทานตะวัน=1\nเลือกถั่วแปบ=2\nเลือกจิ้นส้มหมก=3\n");
        scanf("%d", &selectsnack);
        while(Condition2){
        if(selectsnack==1){
          if(s<=0){
            printf("ขออภัยสินค้าหมด");
            Condition2 = false;
          }
            sun=sun+1;
            s=s-1;
            printf("ท่านเลือกกทานตะวัน %d ชิ้น\n",sun);
             printf("\n------------------------------------------------------------\n");
            break;
        }
        else if(selectsnack==2){
          if (n<=0)
          {
           printf("ขออภัยสินค้าหมด");
           Condition2 = false;
          }
          nut=nut+1;
          n=n-1;
          printf("ท่านเลือกถั่วแปบ %d ชิ้น\n",nut);     
           printf("\n------------------------------------------------------------\n");
          break;
        }
        else if(selectsnack==3){
          if (so<=0){
            printf("ขออภัยสินค้าหมด");
           Condition2 = false;
          }
          som=som+1;
          so=so-1;
          printf("ท่านเลือกจิ้นส้มหมก %d ชิ้น\n",som); 
           printf("\n------------------------------------------------------------\n");
          break;
          }
        }
       }
     else if (select == 2){
      printf("------------------------------------------------------------\n");
      printf("โค้กกระป๋อง 10 บาท\nน้ำเขียวกระป๋อง 12 บาท\nอเมริกาโน่ 30บาท\nลาเต้หวานเจี๊ยบ 35 บาท");
      printf("\n------------------------------------------------------------\n");
      printf("กรุณาเลือกสินค้า\n");
      printf("เลือกโค้กกระป๋อง=1\nเลือกน้ำเขียวกระป๋อง=2\nเลือกอเมริกาโน่=3\nเลือกลาเต้หวานเจี๊ยบ=4\n");
      scanf("%d",&selectwalter);
      while(Condition3){
        if(selectwalter==1){
          if(c<=0){
             printf("ขออภัยสินค้าหมด");
             Condition3=false;
          }
          coke=coke+1;
          c=c-1;
          printf("ท่านเลือกโค้กกระป๋อง %d ชิ้น\n",coke);    
           printf("\n------------------------------------------------------------\n");
          break;
        }
        else if (selectwalter==2){
          if(g<=0){
             printf("ขออภัยสินค้าหมด");
               Condition3=false;
          }
          green=green+1;
          g=g-1;
          printf("ท่านเลือกน้ำเขียวกระป่อง %d ชิ้น\n",green);   
           printf("\n------------------------------------------------------------\n");
          break;
        }
        else if(selectwalter==3){
          if(a<=0){
             printf("ขออภัยสินค้าหมด");
              Condition3=false;
          }
          ame=ame+1;
          a=a-1;
          printf("ท่านเลือกอเมริกาโน่ %d ชิ้น\n",ame);   
           printf("\n------------------------------------------------------------\n");
          break;
        }
        else if(selectwalter==4){
          if(l<=0){
             printf("ขออภัยสินค้าหมด");
              Condition3=false;
          }
          late=late+1;
          l=l-1;
          printf("ท่านเลืออกลาเต้หวานเจี๊ยบ %d ชิ้น\n",late);
           printf("\n------------------------------------------------------------\n");
          break;
        }
      }
     }
      else{
            printf("กรุณาเลือก(1)หรือ(2)");
            printf("\n------------------------------------------------------------");
            while (getchar() != '\n');
        continue; 
        }
        printf("ต้องการเลือกสินค้าเพิ่มหรือไม่ (ใช่=1  ไม่=2)\n");
        scanf("%d",&add);
        if(add==2){
          Condition1=false;
        }
   }
   while(Condition4) {printf("ท่านเลือก\nเมล็ดท่านตะวัน %d ชื้น\nถั่วแปบ %d ชิ้น\nจิ้นส้มหมก %d ชิ้น\nโค้กกระป๋อง %d ชิ้น\nน้ำเขียวกระป๋อง %d ชิ้น\nอเมริกาโน่ %d ชิ้น\nลาเต้หวานเจี๊ยบ %d ชิ้น\n",sun,nut,som,coke,green,ame,late);
    printf("\n------------------------------------------------------------\n");
    printf("ท่านต้องการยกเลิกสินค่าหรือไม่(ใช่=1 ไม่=2)\n");
    scanf("%d",&cancel);

    if(cancel==2){
      Condition4=false;
    }
    else if(cancel==1) {printf("ต้องการยกเลิก\nเมล็ดทานตะวัน(กด 1)\nถั่วแปบ(กด 2)\nจิ้นส้มหมก(กด 3)\nโค้กกระป่อง(กด 4)\nน้ำเขียวกระป๋อง(กด 5)\nอเมริกาโน่(กด 6)\nลาเต้หวานเจี๊ยบ(กด 7)\n");
      while(Condition5){
      scanf("%d",&dismiss);
      if(dismiss==1){
        if(sun>0){
         sun=sun-1;
            s=s+1;
            printf("ท่านยกเลิกทานตะวันสำเร็จ\n");
            printf("\n------------------------------------------------------------\n");
                break;
        }else {printf("ท่านยกเลิกท่านตะวันหมดแล้ว\n");
          printf("\n------------------------------------------------------------\n");
                break;
        }
      }
      else if(dismiss==2){
        if(nut>0){nut=nut-1;
        n=n+1;
        printf("ท่านยกเลิกถั่วแปบสำเร็จ\n");
        printf("\n------------------------------------------------------------\n");
            break;
        }else{printf("ท่านยกเลิกถั่วแปบหมดแล้ว\n");
          printf("\n------------------------------------------------------------\n");
            break;
        }
      }
      else if(dismiss==3){
       if(som>0){
           som=som-1;
           so=so+1;
           printf("ท่านยกเลิกจิ้นส้มหมกสำเร็จ\n");
           printf("\n------------------------------------------------------------\n");
           break;
       }else{
           printf("ท่านยกเลิกจิ้นส้มหมกหมดแล้ว\n");
           printf("\n------------------------------------------------------------\n");
           break;
       }
      }
      else if(dismiss==4){
        if(coke>0){
            coke=coke-1;
            c=c+1;
            printf("ท่านยกเลิกโค้กกระป๋องสำเร็จ\n");
            printf("\n------------------------------------------------------------\n");
            break;
        }
        else{
            printf("ท่านยกเลิกโค้กกระป๋องหมดแล้ว\n");
            printf("\n------------------------------------------------------------\n");
            break;
        }
      }
      else if(dismiss==5){
        if(green>0){
            green=green-1;
            g=g+1;
            printf("ท่านยกเลิกน้ำเขียวกระป๋องสำเร็จ\n");
            printf("\n------------------------------------------------------------\n");
            break;
        }else{
            printf("ท่านยกเลิกน้ำเขียวกระป๋องหมดแล้ว\n");
            printf("\n------------------------------------------------------------\n");
            break;
        }
      }
      else if(dismiss==6){
        if(late>0){
            ame=ame-1;
            l=l+1;
            printf("ท่านยกเลิกอเมริกาโน่สำเร็จ\n");
            printf("\n------------------------------------------------------------\n");
            break;
        }else{
            printf("ท่านยกเลิกอเมริกาโน่หมดแล้ว\n");
            printf("\n------------------------------------------------------------\n");
        }
      }
      else if(dismiss==7){
        if(late>0){
            late=late-1;
            l=l+1;
            printf("ท่านยกเลิกลาเต้สำเร็จ\n");
            printf("\n------------------------------------------------------------\n");
            break;
        }
      
      else {
          printf("ท่านยกเลิกลาเต้หมดแล้ว\n");
          printf("\n------------------------------------------------------------\n");
          break;
       }
      }
     }
    }
  while(Condition6){
  printf("ราคาสินค้า\n");
  printf("เมล็ดทานตะวัน = %d บาท\nถั่วแปบ = %d บาท\nจิ้นส้มหมก = %d บาท\nโค็กกระป๋อง = %d บาท\nน้ำเขียวกระป๋อง = %d บาท\nอเมริกาโน่ = %d บาท\nลาเต้หวานเจี๊ยบ = %d บาท\nราคารวม = %d บาท\n",sun*13,nut*20,som*15,coke*10,green*12,ame*30,late*35,(sun*13)+(nut*20)+(som*15)+(coke*10)+(green*12)+(ame*30)+(late*35));
  printf("ท่านต้องการชำระเงินหรือไม่ (ใช่=1 ไม่=2)\n");
  scanf("%d",&buy);
  if(buy==2){
    Condition6=false;
  }
  else if(buy==1){
    
  }
}
  }
     return 0;
}